tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18856_tdd.h
#define SSP2STAT_I2C_READ             522
#define SSP2STAT_READ_WRITE           523
#define SSP2STAT_R_nW                 524
#define SSP2STAT_nW                   525
#define SSP2STAT_I2C_START            526
#define SSP2STAT_S                    527
#define SSP2STAT_I2C_STOP             528
#define SSP2STAT_P                    529
#define SSP2STAT_I2C_DAT              530
#define SSP2STAT_D_nA                 531
#define SSP2STAT_DATA_ADDRESS         532
#define SSP2STAT_nADDRESS             533
#define SSP2STAT_nA                   534
#define SSP2STAT_D_A                  535
#define SSP2STAT_CKE                  536
#define SSP2STAT_SMP                  537
#define SSP2CON1                      538
#define SSP2CON1_SSPM                 539
#define SSP2CON1_SSPM0                540
#define SSP2CON1_SSPM1                541
#define SSP2CON1_SSPM2                542
#define SSP2CON1_SSPM3                543
#define SSP2CON1_CKP                  544
#define SSP2CON1_SSPEN                545
#define SSP2CON1_SSPOV                546
#define SSP2CON1_WCOL                 547
#define SSP2CON2                      548
#define SSP2CON2_SEN                  549
#define SSP2CON2_ADMSK                550
#define SSP2CON2_RSEN                 551
#define SSP2CON2_ADMSK1               552
#define SSP2CON2_PEN                  553
#define SSP2CON2_ADMSK2               554
#define SSP2CON2_RCEN                 555
#define SSP2CON2_ADMSK3               556
#define SSP2CON2_ADMSK4               557
#define SSP2CON2_ACKEN                558
#define SSP2CON2_ADMSK5               559
#define SSP2CON2_ACKDT                560
#define SSP2CON2_ACKSTAT              561
#define SSP2CON2_GCEN                 562
#define SSP2CON3                      563
#define SSP2CON3_DHEN                 564
#define SSP2CON3_AHEN                 565
#define SSP2CON3_SBCDE                566
#define SSP2CON3_SDAHT                567
#define SSP2CON3_BOEN                 568
#define SSP2CON3_SCIE                 569
#define SSP2CON3_PCIE                 570
#define SSP2CON3_ACKTIM               571
#define TMR1L                         572
#define TMR1L0                        573
#define TMR1L1                        574
#define TMR1L2                        575
#define TMR1L3                        576
#define TMR1L4                        577
#define TMR1L5                        578
#define TMR1L6                        579
#define TMR1L7                        580
#define TMR1H0                        581
#define TMR1H                         582
#define TMR1H1                        583
#define TMR1H2                        584
#define TMR1H3                        585
#define TMR1H4                        586
#define TMR1H5                        587
#define TMR1H6                        588
#define TMR1H7                        589
#define T1CON                         590
#define TMR1ON                        591
#define T1CON_ON                      592
#define T1CON_RD16                    593
#define T1RD16                        594
#define nT1SYNC                       595
#define T1CON_nSYNC                   596
#define T1CON_CKPS0                   597
#define T1CKPS0                       598
#define T1CON_CKPS                    599
#define T1CKPS1                       600
#define T1CON_CKPS1                   601
#define T1GCON                        602
#define T1GCON_GVAL                   603
#define T1GVAL                        604
#define T1GGO_nDONE                   605
#define T1GCON_GGO_nDONE              606
#define T1GGO                         607
#define T1GSPM                        608
#define T1GCON_GSPM                   609
#define T1GTM                         610
#define T1GCON_GTM                    611
#define T1GPOL                        612
#define T1GCON_GPOL                   613
#define T1GE                          614
#define T1GCON_GE                     615
#define T1GATE                        616
#define T1GSS0                        617
#define T1GATE_GSS                    618
#define T1GATE_GSS0                   619
#define T1GATE_GSS1                   620
#define T1GSS1                        621
#define T1GSS2                        622
#define T1GATE_GSS2                   623
#define T1GSS3                        624
#define T1GATE_GSS3                   625
#define T1GATE_GSS4                   626
#define T1GSS4                        627
#define T1CLK                         628
#define T1CS0                         629
#define T1CLK_CS                      630
#define T1CLK_CS0                     631
#define T1CLK_CS1                     632
#define T1CS1                         633
#define T1CS2                         634
#define T1CLK_CS2                     635
#define T1CS3                         636
#define T1CLK_CS3                     637
#define TMR3L0                        638
#define TMR3L                         639
#define TMR3L1                        640
#define TMR3L2                        641
#define TMR3L3                        642
#define TMR3L4                        643
#define TMR3L5                        644
#define TMR3L6                        645
#define TMR3L7                        646
#define TMR3H                         647
#define TMR3H0                        648
#define TMR3H1                        649
#define TMR3H2                        650
#define TMR3H3                        651
#define TMR3H4                        652
#define TMR3H5                        653
#define TMR3H6                        654
#define TMR3H7                        655
#define T3CON                         656
#define TMR3ON                        657
#define T3CON_ON                      658
#define T3CON_RD16                    659
#define T3RD16                        660
#define nT3SYNC                       661
#define T3CON_nSYNC                   662
#define T3CKPS0                       663
#define T3CON_CKPS                    664
#define T3CON_CKPS0                   665
#define T3CKPS1                       666
#define T3CON_CKPS1                   667
#define T3GCON                        668
#define T3GVAL                        669
#define T3GCON_GVAL                   670
#define T3GGO                         671
#define T3GCON_GGO_nDONE              672
#define T3GGO_nDONE                   673
#define T3GCON_GSPM                   674
#define T3GSPM                        675
#define T3GTM                         676
#define T3GCON_GTM                    677
#define T3GPOL                        678
#define T3GCON_GPOL                   679
#define T3GCON_GE                     680
#define T3GE                          681
#define T3GATE                        682
#define T3GSS0                        683
#define T3GATE_GSS0                   684
#define T3GATE_GSS                    685
#define T3GATE_GSS1                   686
#define T3GSS1                        687
#define T3GSS2                        688
#define T3GATE_GSS2                   689
#define T3GATE_GSS3                   690
#define T3GSS3                        691
#define T3GATE_GSS4                   692
#define T3GSS4                        693
#define T3CLK                         694
#define T3CLK_CS                      695
#define T3CLK_CS0                     696
#define T3CS0                         697
#define T3CLK_CS1                     698
#define T3CS1                         699
#define T3CLK_CS2                     700
#define T3CS2                         701
#define T3CS3                         702
#define T3CLK_CS3                     703
#define TMR5L                         704
#define TMR5L0                        705
#define TMR5L1                        706
#define TMR5L2                        707
#define TMR5L3                        708
#define TMR5L4                        709
#define TMR5L5                        710
#define TMR5L6                        711
#define TMR5L7                        712
#define TMR5H0                        713
#define TMR5H                         714
#define TMR5H1                        715
#define TMR5H2                        716
#define TMR5H3                        717
#define TMR5H4                        718
#define TMR5H5                        719
#define TMR5H6                        720
#define TMR5H7                        721
#define T5CON                         722
#define T5CON_ON                      723
#define TMR5ON                        724
#define T5CON_RD16                    725
#define T5RD16                        726
#define T5CON_nSYNC                   727
#define nT5SYNC                       728
#define T5CON_CKPS0                   729
#define T5CON_CKPS                    730
#define T5CKPS0                       731
#define T5CON_CKPS1                   732
#define T5CKPS1                       733
#define T5GCON                        734
#define T5GCON_GVAL                   735
#define T5GVAL                        736
#define T5GCON_GGO_nDONE              737
#define T5GGO_nDONE                   738
#define T5GGO                         739
#define T5GCON_GSPM                   740
#define T5GSPM                        741
#define T5GTM                         742
#define T5GCON_GTM                    743
#define T5GPOL                        744
#define T5GCON_GPOL                   745
#define T5GCON_GE                     746
#define T5GE                          747
#define T5GATE                        748
#define T5GATE_GSS0                   749
#define T5GSS0                        750
#define T5GATE_GSS                    751
#define T5GSS1                        752
#define T5GATE_GSS1                   753
#define T5GATE_GSS2                   754
#define T5GSS2                        755
#define T5GATE_GSS3                   756
#define T5GSS3                        757
#define T5GSS4                        758
#define T5GATE_GSS4                   759
#define T5CLK                         760
#define T5CS0                         761
#define T5CLK_CS                      762
#define T5CLK_CS0                     763
#define T5CS1                         764
#define T5CLK_CS1                     765
#define T5CS2                         766
#define T5CLK_CS2                     767
#define T5CS3                         768
#define T5CLK_CS3                     769
#define CCPTMRS0                      770
#define C1TSEL0                       771
#define C1TSEL                        772
#define C1TSEL1                       773
#define C2TSEL0                       774
#define C2TSEL                        775
#define C2TSEL1                       776
#define C3TSEL0                       777
#define C3TSEL                        778
#define C3TSEL1                       779
#define C4TSEL                        780
#define C4TSEL0                       781
#define C4TSEL1                       782
#define CCPTMRS1                      783
#define C5TSEL                        784
#define C5TSEL0                       785
#define C5TSEL1                       786
#define P6TSEL0                       787
#define P6TSEL                        788
#define P6TSEL1                       789
#define P7TSEL0                       790
#define P7TSEL                        791
#define P7TSEL1                       792
#define T2TMR                         793
#define TMR2                          794
#define T2PR                          795
#define PR2                           796
#define T2CON                         797
#define T2OUTPS0                      798
#define T2CON_OUTPS0                  799
#define T2OUTPS                       800
#define T2CON_OUTPS                   801
#define T2OUTPS1                      802
#define T2CON_OUTPS1                  803
#define T2OUTPS2                      804
#define T2CON_OUTPS2                  805
#define T2OUTPS3                      806
#define T2CON_OUTPS3                  807
#define T2CKPS0                       808
#define T2CON_CKPS0                   809
#define T2CON_CKPS                    810
#define T2CKPS                        811
#define T2CKPS1                       812
#define T2CON_CKPS1                   813
#define T2CKPS2                       814
#define T2CON_CKPS2                   815
#define T2CON_ON                      816
#define TMR2ON                        817
#define T2ON                          818
#define T2HLT                         819
#define T2HLT_MODE                    820
#define T2MODE                        821
#define T2MODE0                       822
#define T2HLT_MODE0                   823
#define T2MODE1                       824
#define T2HLT_MODE1                   825
#define T2MODE2                       826
#define T2HLT_MODE2                   827
#define T2MODE3                       828
#define T2HLT_MODE3                   829
#define T2MODE4                       830
#define T2HLT_MODE4                   831
#define T2HLT_CKSYNC                  832
#define T2CKSYNC                      833
#define T2HLT_CKPOL                   834
#define T2CKPOL                       835
#define T2PSYNC                       836
#define T2HLT_PSYNC                   837
#define T2CLKCON                      838
#define T2CS                          839
#define T2CS0                         840
#define T2CS1                         841
#define T2CS2                         842
#define T2CS3                         843
#define T2RST                         844
#define T2RSEL                        845
#define T2RST_RSEL                    846
#define T2RSEL0                       847
#define T2RST_RSEL0                   848
#define T2RSEL1                       849
#define T2RST_RSEL1                   850
#define T2RST_RSEL2                   851
#define T2RSEL2                       852
#define T2RSEL3                       853
#define T2RST_RSEL3                   854
#define T2RSEL4                       855
#define T2RST_RSEL4                   856
#define T4TMR                         857
#define TMR4                          858
#define T4PR                          859
#define PR4                           860
#define T4CON                         861
#define T4CON_OUTPS                   862
#define T4OUTPS0                      863
#define T4OUTPS                       864
#define T4CON_OUTPS0                  865
#define T4OUTPS1                      866
#define T4CON_OUTPS1                  867
#define T4CON_OUTPS2                  868
#define T4OUTPS2                      869
#define T4OUTPS3                      870
#define T4CON_OUTPS3                  871
#define T4CKPS0                       872
#define T4CON_CKPS                    873
#define T4CON_CKPS0                   874
#define T4CKPS                        875
#define T4CKPS1                       876
#define T4CON_CKPS1                   877
#define T4CKPS2                       878
#define T4CON_CKPS2                   879
#define T4ON                          880
#define T4CON_ON                      881
#define TMR4ON                        882
#define T4HLT                         883
#define T4MODE                        884
#define T4HLT_MODE                    885
#define T4HLT_MODE0                   886
#define T4MODE0                       887
#define T4HLT_MODE1                   888
#define T4MODE1                       889
#define T4HLT_MODE2                   890
#define T4MODE2                       891
#define T4HLT_MODE3                   892
#define T4MODE3                       893
#define T4HLT_MODE4                   894
#define T4MODE4                       895
#define T4CKSYNC                      896
#define T4HLT_CKSYNC                  897
#define T4HLT_CKPOL                   898
#define T4CKPOL                       899
#define T4PSYNC                       900
#define T4HLT_PSYNC                   901
#define T4CLKCON                      902
#define T4CS0                         903
#define T4CS                          904
#define T4CS1                         905
#define T4CS2                         906
#define T4CS3                         907
#define T4RST                         908
#define T4RST_RSEL                    909
#define T4RSEL0                       910
#define T4RSEL                        911
#define T4RST_RSEL0                   912
#define T4RSEL1                       913
#define T4RST_RSEL1                   914
#define T4RSEL2                       915
#define T4RST_RSEL2                   916
#define T4RSEL3                       917
#define T4RST_RSEL3                   918
#define T4RSEL4                       919
#define T4RST_RSEL4                   920
#define T6TMR                         921
#define TMR6                          922
#define T6PR                          923
#define PR6                           924
#define T6CON                         925
#define T6CON_OUTPS0                  926
#define T6OUTPS                       927
#define T6CON_OUTPS                   928
#define T6OUTPS0                      929
#define T6CON_OUTPS1                  930
#define T6OUTPS1                      931
#define T6CON_OUTPS2                  932
#define T6OUTPS2                      933
#define T6CON_OUTPS3                  934
#define T6OUTPS3                      935
#define T6CON_CKPS0                   936
#define T6CKPS                        937
#define T6CKPS0                       938
#define T6CON_CKPS                    939
#define T6CON_CKPS1                   940
#define T6CKPS1                       941
#define T6CON_CKPS2                   942
#define T6CKPS2                       943
#define TMR6ON                        944
#define T6ON                          945
#define T6CON_ON                      946
#define T6HLT                         947
#define T6MODE0                       948
#define T6HLT_MODE0                   949
#define T6HLT_MODE                    950
#define T6MODE                        951
#define T6HLT_MODE1                   952
#define T6MODE1                       953
#define T6HLT_MODE2                   954
#define T6MODE2                       955
#define T6HLT_MODE3                   956
#define T6MODE3                       957
#define T6MODE4                       958
#define T6HLT_MODE4                   959
#define T6CKSYNC                      960
#define T6HLT_CKSYNC                  961
#define T6CKPOL                       962
#define T6HLT_CKPOL                   963
#define T6PSYNC                       964
#define T6HLT_PSYNC                   965
#define T6CLKCON                      966
#define T6CS                          967
#define T6CS0                         968
#define T6CS1                         969
#define T6CS2                         970
#define T6CS3                         971
#define T6RST                         972
#define T6RST_RSEL                    973
#define T6RSEL                        974
#define T6RSEL0                       975
#define T6RST_RSEL0                   976
#define T6RST_RSEL1                   977
#define T6RSEL1                       978
#define T6RSEL2                       979
#define T6RST_RSEL2                   980
#define T6RST_RSEL3                   981
#define T6RSEL3                       982
#define T6RST_RSEL4                   983
#define T6RSEL4                       984
#define CCPR1L                        985
#define CCPR1L_RL                     986
#define CCPR1H                        987
#define CCPR1H_RH                     988
#define CCP1CON                       989
#define CCP1MODE0                     990
#define CCP1CON_MODE0                 991
#define CCP1CON_MODE                  992
#define CCP1MODE                      993
#define CCP1MODE1                     994
#define CCP1CON_MODE1                 995
#define CCP1MODE2                     996
#define CCP1CON_MODE2                 997
#define CCP1MODE3                     998
#define CCP1CON_MODE3                 999
#define CCP1FMT                       1000
#define CCP1CON_FMT                   1001
#define CCP1CON_OUT                   1002
#define CCP1OUT                       1003
#define CCP1CON_OE                    1004
#define CCP1OE                        1005
#define CCP1EN                        1006
#define CCP1CON_EN                    1007
#define CCP1CAP                       1008
#define CCP1CTS0                      1009
#define CCP1CAP_CTS                   1010
#define CCP1CAP_CTS0                  1011
#define CCP1CTS                       1012
#define CCP1CTS1                      1013
#define CCP1CAP_CTS1                  1014
#define CCP1CTS2                      1015
#define CCP1CAP_CTS2                  1016
#define CCPR2L                        1017
#define CCPR2L_RL                     1018
#define CCPR2H                        1019
#define CCPR2H_RH                     1020
#define CCP2CON                       1021
#define CCP2MODE                      1022
#define CCP2MODE0                     1023
#define CCP2CON_MODE0                 1024
#define CCP2CON_MODE                  1025
#define CCP2MODE1                     1026
#define CCP2CON_MODE1                 1027
#define CCP2MODE2                     1028
#define CCP2CON_MODE2                 1029
#define CCP2MODE3                     1030
#define CCP2CON_MODE3                 1031
#define CCP2FMT                       1032
#define CCP2CON_FMT                   1033
#define CCP2OUT                       1034
#define CCP2CON_OUT                   1035
#define CCP2OE                        1036
#define CCP2CON_OE                    1037
#define CCP2EN                        1038
#define CCP2CON_EN                    1039
#define CCP2CAP                       1040
#define CCP2CAP_CTS                   1041
#define CCP2CAP_CTS0                  1042
#define CCP2CTS                       1043
#define CCP2CTS0                      1044
#define CCP2CAP_CTS1                  1045
#define CCP2CTS1                      1046
#define CCP2CAP_CTS2                  1047
#define CCP2CTS2                      1048
#define CCPR3L                        1049
#define CCPR3L_RL                     1050
#define CCPR3H                        1051
#define CCPR3H_RH                     1052
#define CCP3CON                       1053
#define CCP3CON_MODE0                 1054
#define CCP3MODE0                     1055
#define CCP3CON_MODE                  1056
#define CCP3MODE                      1057
#define CCP3CON_MODE1                 1058
#define CCP3MODE1                     1059
#define CCP3CON_MODE2                 1060
#define CCP3MODE2                     1061
#define CCP3CON_MODE3                 1062
#define CCP3MODE3                     1063
#define CCP3CON_FMT                   1064
#define CCP3FMT                       1065
#define CCP3CON_OUT                   1066
#define CCP3OUT                       1067
#define CCP3OE                        1068
#define CCP3CON_OE                    1069
#define CCP3EN                        1070
#define CCP3CON_EN                    1071
#define CCP3CAP                       1072
#define CCP3CAP_CTS0                  1073
#define CCP3CTS                       1074
#define CCP3CAP_CTS                   1075
#define CCP3CTS0                      1076
#define CCP3CAP_CTS1                  1077
#define CCP3CTS1                      1078
#define CCP3CAP_CTS2                  1079
#define CCP3CTS2                      1080
#define CCPR4L                        1081
#define CCPR4L_RL                     1082
#define CCPR4H                        1083
#define CCPR4H_RH                     1084
#define CCP4CON                       1085
#define CCP4MODE                      1086
#define CCP4CON_MODE0                 1087
#define CCP4CON_MODE                  1088
#define CCP4MODE0                     1089
#define CCP4CON_MODE1                 1090
