tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18856_tdd.h
#define LC4D1S0                       3323
#define CLC4SEL0_D1S                  3324
#define CLC4SEL0_D1S0                 3325
#define LC4D1S                        3326
#define LC4D1S1                       3327
#define CLC4SEL0_D1S1                 3328
#define LC4D1S2                       3329
#define CLC4SEL0_D1S2                 3330
#define LC4D1S3                       3331
#define CLC4SEL0_D1S3                 3332
#define LC4D1S4                       3333
#define CLC4SEL0_D1S4                 3334
#define LC4D1S5                       3335
#define CLC4SEL0_D1S5                 3336
#define LC4D1S6                       3337
#define CLC4SEL0_D1S6                 3338
#define LC4D1S7                       3339
#define CLC4SEL0_D1S7                 3340
#define CLC4SEL1                      3341
#define CLC4SEL1_D2S                  3342
#define CLC4SEL1_D2S0                 3343
#define LC4D2S                        3344
#define LC4D2S0                       3345
#define CLC4SEL1_D2S1                 3346
#define LC4D2S1                       3347
#define CLC4SEL1_D2S2                 3348
#define LC4D2S2                       3349
#define CLC4SEL1_D2S3                 3350
#define LC4D2S3                       3351
#define CLC4SEL1_D2S4                 3352
#define LC4D2S4                       3353
#define CLC4SEL1_D2S5                 3354
#define LC4D2S5                       3355
#define CLC4SEL1_D2S6                 3356
#define LC4D2S6                       3357
#define CLC4SEL1_D2S7                 3358
#define LC4D2S7                       3359
#define CLC4SEL2                      3360
#define CLC4SEL2_D3S                  3361
#define LC4D3S0                       3362
#define LC4D3S                        3363
#define CLC4SEL2_D3S0                 3364
#define LC4D3S1                       3365
#define CLC4SEL2_D3S1                 3366
#define LC4D3S2                       3367
#define CLC4SEL2_D3S2                 3368
#define LC4D3S3                       3369
#define CLC4SEL2_D3S3                 3370
#define LC4D3S4                       3371
#define CLC4SEL2_D3S4                 3372
#define LC4D3S5                       3373
#define CLC4SEL2_D3S5                 3374
#define LC4D3S6                       3375
#define CLC4SEL2_D3S6                 3376
#define LC4D3S7                       3377
#define CLC4SEL2_D3S7                 3378
#define CLC4SEL3                      3379
#define CLC4SEL3_D4S                  3380
#define LC4D4S0                       3381
#define CLC4SEL3_D4S0                 3382
#define LC4D4S                        3383
#define LC4D4S1                       3384
#define CLC4SEL3_D4S1                 3385
#define LC4D4S2                       3386
#define CLC4SEL3_D4S2                 3387
#define LC4D4S3                       3388
#define CLC4SEL3_D4S3                 3389
#define LC4D4S4                       3390
#define CLC4SEL3_D4S4                 3391
#define LC4D4S5                       3392
#define CLC4SEL3_D4S5                 3393
#define LC4D4S6                       3394
#define CLC4SEL3_D4S6                 3395
#define LC4D4S7                       3396
#define CLC4SEL3_D4S7                 3397
#define CLC4GLS0                      3398
#define CLC4GLS0_D1N                  3399
#define LC4G1D1N                      3400
#define CLC4GLS0_D1T                  3401
#define LC4G1D1T                      3402
#define CLC4GLS0_D2N                  3403
#define LC4G1D2N                      3404
#define CLC4GLS0_D2T                  3405
#define LC4G1D2T                      3406
#define CLC4GLS0_D3N                  3407
#define LC4G1D3N                      3408
#define CLC4GLS0_D3T                  3409
#define LC4G1D3T                      3410
#define CLC4GLS0_D4N                  3411
#define LC4G1D4N                      3412
#define CLC4GLS0_D4T                  3413
#define LC4G1D4T                      3414
#define CLC4GLS1                      3415
#define CLC4GLS1_D1N                  3416
#define LC4G2D1N                      3417
#define CLC4GLS1_D1T                  3418
#define LC4G2D1T                      3419
#define LC4G2D2N                      3420
#define CLC4GLS1_D2N                  3421
#define LC4G2D2T                      3422
#define CLC4GLS1_D2T                  3423
#define CLC4GLS1_D3N                  3424
#define LC4G2D3N                      3425
#define LC4G2D3T                      3426
#define CLC4GLS1_D3T                  3427
#define CLC4GLS1_D4N                  3428
#define LC4G2D4N                      3429
#define CLC4GLS1_D4T                  3430
#define LC4G2D4T                      3431
#define CLC4GLS2                      3432
#define CLC4GLS2_D1N                  3433
#define LC4G3D1N                      3434
#define CLC4GLS2_D1T                  3435
#define LC4G3D1T                      3436
#define LC4G3D2N                      3437
#define CLC4GLS2_D2N                  3438
#define LC4G3D2T                      3439
#define CLC4GLS2_D2T                  3440
#define CLC4GLS2_D3N                  3441
#define LC4G3D3N                      3442
#define CLC4GLS2_D3T                  3443
#define LC4G3D3T                      3444
#define LC4G3D4N                      3445
#define CLC4GLS2_D4N                  3446
#define LC4G3D4T                      3447
#define CLC4GLS2_D4T                  3448
#define CLC4GLS3                      3449
#define CLC4GLS3_G4D1N                3450
#define LC4G4D1N                      3451
#define LC4G4D1T                      3452
#define CLC4GLS3_G4D1T                3453
#define LC4G4D2N                      3454
#define CLC4GLS3_G4D2N                3455
#define LC4G4D2T                      3456
#define CLC4GLS3_G4D2T                3457
#define CLC4GLS3_G4D3N                3458
#define LC4G4D3N                      3459
#define CLC4GLS3_G4D3T                3460
#define LC4G4D3T                      3461
#define LC4G4D4N                      3462
#define CLC4GLS3_G4D4N                3463
#define LC4G4D4T                      3464
#define CLC4GLS3_G4D4T                3465
#define PPSLOCK                       3466
#define PPSLOCKED                     3467
#define INTPPS0                       3468
#define INTPPS                        3469
#define INTPPS1                       3470
#define INTPPS2                       3471
#define INTPPS3                       3472
#define T0CKIPPS                      3473
#define T0CKIPPS0                     3474
#define T0CKIPPS1                     3475
#define T0CKIPPS2                     3476
#define T0CKIPPS3                     3477
#define T1CKIPPS0                     3478
#define T1CKIPPS                      3479
#define T1CKIPPS1                     3480
#define T1CKIPPS2                     3481
#define T1CKIPPS3                     3482
#define T1CKIPPS4                     3483
#define T1GPPS0                       3484
#define T1GPPS                        3485
#define T1GPPS1                       3486
#define T1GPPS2                       3487
#define T1GPPS3                       3488
#define T1GPPS4                       3489
#define T3CKIPPS0                     3490
#define T3CKIPPS                      3491
#define T3CKIPPS1                     3492
#define T3CKIPPS2                     3493
#define T3CKIPPS3                     3494
#define T3CKIPPS4                     3495
#define T3GPPS0                       3496
#define T3GPPS                        3497
#define T3GPPS1                       3498
#define T3GPPS2                       3499
#define T3GPPS3                       3500
#define T3GPPS4                       3501
#define T5CKIPPS0                     3502
#define T5CKIPPS                      3503
#define T5CKIPPS1                     3504
#define T5CKIPPS2                     3505
#define T5CKIPPS3                     3506
#define T5CKIPPS4                     3507
#define T5GPPS                        3508
#define T5GPPS0                       3509
#define T5GPPS1                       3510
#define T5GPPS2                       3511
#define T5GPPS3                       3512
#define T5GPPS4                       3513
#define T2AINPPS                      3514
#define T2AINPPS0                     3515
#define T2AINPPS1                     3516
#define T2AINPPS2                     3517
#define T2AINPPS3                     3518
#define T2AINPPS4                     3519
#define T4AINPPS                      3520
#define T4AINPPS0                     3521
#define T4AINPPS1                     3522
#define T4AINPPS2                     3523
#define T4AINPPS3                     3524
#define T4AINPPS4                     3525
#define T6AINPPS0                     3526
#define T6AINPPS                      3527
#define T6AINPPS1                     3528
#define T6AINPPS2                     3529
#define T6AINPPS3                     3530
#define T6AINPPS4                     3531
#define CCP1PPS0                      3532
#define CCP1PPS                       3533
#define CCP1PPS1                      3534
#define CCP1PPS2                      3535
#define CCP1PPS3                      3536
#define CCP1PPS4                      3537
#define CCP2PPS0                      3538
#define CCP2PPS                       3539
#define CCP2PPS1                      3540
#define CCP2PPS2                      3541
#define CCP2PPS3                      3542
#define CCP2PPS4                      3543
#define CCP3PPS0                      3544
#define CCP3PPS                       3545
#define CCP3PPS1                      3546
#define CCP3PPS2                      3547
#define CCP3PPS3                      3548
#define CCP3PPS4                      3549
#define CCP4PPS0                      3550
#define CCP4PPS                       3551
#define CCP4PPS1                      3552
#define CCP4PPS2                      3553
#define CCP4PPS3                      3554
#define CCP4PPS4                      3555
#define CCP5PPS                       3556
#define CCP5PPS0                      3557
#define CCP5PPS1                      3558
#define CCP5PPS2                      3559
#define CCP5PPS3                      3560
#define CCP5PPS4                      3561
#define CCP6PPS                       3562
#define SMT1WINPPS                    3563
#define SMU1WINPPS0                   3564
#define SMU1WINPPS1                   3565
#define SMU1WINPPS2                   3566
#define SMU1WINPPS3                   3567
#define SMU1WINPPS4                   3568
#define SMT1SIGPPS                    3569
#define SMU1SIGPPS0                   3570
#define SMU1SIGPPS1                   3571
#define SMU1SIGPPS2                   3572
#define SMU1SIGPPS3                   3573
#define SMU1SIGPPS4                   3574
#define SMT2WINPPS                    3575
#define SMU2WINPPS0                   3576
#define SMU2WINPPS1                   3577
#define SMU2WINPPS2                   3578
#define SMU2WINPPS3                   3579
#define SMU2WINPPS4                   3580
#define SMT2SIGPPS                    3581
#define SMU2SIGPPS0                   3582
#define SMU2SIGPPS1                   3583
#define SMU2SIGPPS2                   3584
#define SMU2SIGPPS3                   3585
#define SMU2SIGPPS4                   3586
#define CWG1PPS0                      3587
#define CWG1PPS                       3588
#define CWG1PPS1                      3589
#define CWG1PPS2                      3590
#define CWG1PPS3                      3591
#define CWG1PPS4                      3592
#define CWG2PPS0                      3593
#define CWG2PPS                       3594
#define CWG2PPS1                      3595
#define CWG2PPS2                      3596
#define CWG2PPS3                      3597
#define CWG2PPS4                      3598
#define CWG3PPS0                      3599
#define CWG3PPS                       3600
#define CWG3PPS1                      3601
#define CWG3PPS2                      3602
#define CWG3PPS3                      3603
#define CWG3PPS4                      3604
#define MDCARLPPS                     3605
#define MDCARLPPS0                    3606
#define MDCARLPPS1                    3607
#define MDCARLPPS2                    3608
#define MDCARLPPS3                    3609
#define MDCARLPPS4                    3610
#define MDCARHPPS0                    3611
#define MDCARHPPS                     3612
#define MDCARHPPS1                    3613
#define MDCARHPPS2                    3614
#define MDCARHPPS3                    3615
#define MDCARHPPS4                    3616
#define MDSRCPPS0                     3617
#define MDSRCPPS                      3618
#define MDSRCPPS1                     3619
#define MDSRCPPS2                     3620
#define MDSRCPPS3                     3621
#define MDSRCPPS4                     3622
#define CLCIN0PPS                     3623
#define CLCIN0PPS0                    3624
#define CLCIN0PPS1                    3625
#define CLCIN0PPS2                    3626
#define CLCIN0PPS3                    3627
#define CLCIN0PPS4                    3628
#define CLCIN1PPS0                    3629
#define CLCIN1PPS                     3630
#define CLCIN1PPS1                    3631
#define CLCIN1PPS2                    3632
#define CLCIN1PPS3                    3633
#define CLCIN1PPS4                    3634
#define CLCIN2PPS                     3635
#define CLCIN2PPS0                    3636
#define CLCIN2PPS1                    3637
#define CLCIN2PPS2                    3638
#define CLCIN2PPS3                    3639
#define CLCIN2PPS4                    3640
#define CLCIN3PPS                     3641
#define CLCIN3PPS0                    3642
#define CLCIN3PPS1                    3643
#define CLCIN3PPS2                    3644
#define CLCIN3PPS3                    3645
#define CLCIN3PPS4                    3646
#define ADCACTPPS                     3647
#define ADCACTPPS0                    3648
#define ADCACTPPS1                    3649
#define ADCACTPPS2                    3650
#define ADCACTPPS3                    3651
#define ADCACTPPS4                    3652
#define SSP1CLKPPS0                   3653
#define SSP1CLKPPS                    3654
#define SSP1CLKPPS1                   3655
#define SSP1CLKPPS2                   3656
#define SSP1CLKPPS3                   3657
#define SSP1CLKPPS4                   3658
#define SSP1DATPPS0                   3659
#define SSP1DATPPS                    3660
#define SSP1DATPPS1                   3661
#define SSP1DATPPS2                   3662
#define SSP1DATPPS3                   3663
#define SSP1DATPPS4                   3664
#define SSP1SSPPS                     3665
#define SSP1SSPPS0                    3666
#define SSP1SSPPS1                    3667
#define SSP1SSPPS2                    3668
#define SSP1SSPPS3                    3669
#define SSP1SSPPS4                    3670
#define SSP2CLKPPS                    3671
#define SSP2CLKPPS0                   3672
#define SSP2CLKPPS1                   3673
#define SSP2CLKPPS2                   3674
#define SSP2CLKPPS3                   3675
#define SSP2CLKPPS4                   3676
#define SSP2DATPPS                    3677
#define SSP2DATPPS0                   3678
#define SSP2DATPPS1                   3679
#define SSP2DATPPS2                   3680
#define SSP2DATPPS3                   3681
#define SSP2DATPPS4                   3682
#define SSP2SSPPS                     3683
#define SSP2SSPPS0                    3684
#define SSP2SSPPS1                    3685
#define SSP2SSPPS2                    3686
#define SSP2SSPPS3                    3687
#define SSP2SSPPS4                    3688
#define RXPPS                         3689
#define RXPPS0                        3690
#define RXPPS1                        3691
#define RXPPS2                        3692
#define RXPPS3                        3693
#define RXPPS4                        3694
#define TXPPS0                        3695
#define TXPPS                         3696
#define TXPPS1                        3697
#define TXPPS2                        3698
#define TXPPS3                        3699
#define TXPPS4                        3700
#define RA0PPS                        3701
#define RA0PPS0                       3702
#define RA0PPS1                       3703
#define RA0PPS2                       3704
#define RA0PPS3                       3705
#define RA0PPS4                       3706
#define RA0PPS5                       3707
#define RA1PPS                        3708
#define RA1PPS0                       3709
#define RA1PPS1                       3710
#define RA1PPS2                       3711
#define RA1PPS3                       3712
#define RA1PPS4                       3713
#define RA1PPS5                       3714
#define RA2PPS                        3715
#define RA2PPS0                       3716
#define RA2PPS1                       3717
#define RA2PPS2                       3718
#define RA2PPS3                       3719
#define RA2PPS4                       3720
#define RA2PPS5                       3721
#define RA3PPS                        3722
#define RA3PPS0                       3723
#define RA3PPS1                       3724
#define RA3PPS2                       3725
#define RA3PPS3                       3726
#define RA3PPS4                       3727
#define RA3PPS5                       3728
#define RA4PPS                        3729
#define RA4PPS0                       3730
#define RA4PPS1                       3731
#define RA4PPS2                       3732
#define RA4PPS3                       3733
#define RA4PPS4                       3734
#define RA4PPS5                       3735
#define RA5PPS                        3736
#define RA5PPS0                       3737
#define RA5PPS1                       3738
#define RA5PPS2                       3739
#define RA5PPS3                       3740
#define RA5PPS4                       3741
#define RA5PPS5                       3742
#define RA6PPS                        3743
#define RA6PPS0                       3744
#define RA6PPS1                       3745
#define RA6PPS2                       3746
#define RA6PPS3                       3747
#define RA6PPS4                       3748
#define RA6PPS5                       3749
#define RA7PPS                        3750
#define RA7PPS0                       3751
#define RA7PPS1                       3752
#define RA7PPS2                       3753
#define RA7PPS3                       3754
#define RA7PPS4                       3755
#define RA7PPS5                       3756
#define RB0PPS                        3757
#define RB0PPS0                       3758
#define RB0PPS1                       3759
#define RB0PPS2                       3760
#define RB0PPS3                       3761
#define RB0PPS4                       3762
#define RB0PPS5                       3763
#define RB1PPS                        3764
#define RB1PPS0                       3765
#define RB1PPS1                       3766
#define RB1PPS2                       3767
#define RB1PPS3                       3768
#define RB1PPS4                       3769
#define RB1PPS5                       3770
#define RB2PPS                        3771
#define RB2PPS0                       3772
#define RB2PPS1                       3773
#define RB2PPS2                       3774
#define RB2PPS3                       3775
#define RB2PPS4                       3776
#define RB2PPS5                       3777
#define RB3PPS                        3778
#define RB3PPS0                       3779
#define RB3PPS1                       3780
#define RB3PPS2                       3781
#define RB3PPS3                       3782
#define RB3PPS4                       3783
#define RB3PPS5                       3784
#define RB4PPS                        3785
#define RB4PPS0                       3786
#define RB4PPS1                       3787
#define RB4PPS2                       3788
#define RB4PPS3                       3789
#define RB4PPS4                       3790
#define RB4PPS5                       3791
#define RB5PPS                        3792
#define RB5PPS0                       3793
#define RB5PPS1                       3794
#define RB5PPS2                       3795
#define RB5PPS3                       3796
#define RB5PPS4                       3797
#define RB5PPS5                       3798
#define RB6PPS                        3799
#define RB6PPS0                       3800
#define RB6PPS1                       3801
#define RB6PPS2                       3802
#define RB6PPS3                       3803
#define RB6PPS4                       3804
#define RB6PPS5                       3805
#define RB7PPS                        3806
#define RB7PPS0                       3807
#define RB7PPS1                       3808
#define RB7PPS2                       3809
#define RB7PPS3                       3810
#define RB7PPS4                       3811
#define RB7PPS5                       3812
#define RC0PPS                        3813
#define RC0PPS0                       3814
#define RC0PPS1                       3815
#define RC0PPS2                       3816
#define RC0PPS3                       3817
#define RC0PPS4                       3818
#define RC0PPS5                       3819
#define RC1PPS                        3820
#define RC1PPS0                       3821
#define RC1PPS1                       3822
#define RC1PPS2                       3823
#define RC1PPS3                       3824
#define RC1PPS4                       3825
#define RC1PPS5                       3826
#define RC2PPS                        3827
#define RC2PPS0                       3828
#define RC2PPS1                       3829
#define RC2PPS2                       3830
#define RC2PPS3                       3831
#define RC2PPS4                       3832
#define RC2PPS5                       3833
#define RC3PPS                        3834
#define RC3PPS0                       3835
#define RC3PPS1                       3836
#define RC3PPS2                       3837
#define RC3PPS3                       3838
#define RC3PPS4                       3839
#define RC3PPS5                       3840
#define RC4PPS                        3841
#define RC4PPS0                       3842
#define RC4PPS1                       3843
#define RC4PPS2                       3844
#define RC4PPS3                       3845
#define RC4PPS4                       3846
#define RC4PPS5                       3847
#define RC5PPS                        3848
#define RC5PPS0                       3849
#define RC5PPS1                       3850
#define RC5PPS2                       3851
#define RC5PPS3                       3852
#define RC5PPS4                       3853
#define RC5PPS5                       3854
#define RC6PPS                        3855
#define RC6PPS0                       3856
#define RC6PPS1                       3857
#define RC6PPS2                       3858
#define RC6PPS3                       3859
#define RC6PPS4                       3860
#define RC6PPS5                       3861
#define RC7PPS                        3862
#define RC7PPS0                       3863
#define RC7PPS1                       3864
#define RC7PPS2                       3865
#define RC7PPS3                       3866
#define RC7PPS4                       3867
#define RC7PPS5                       3868
#define ANSELA                        3869
#define ANSA0                         3870
#define ANSA1                         3871
#define ANSA2                         3872
#define ANSA3                         3873
#define ANSA4                         3874
#define ANSA5                         3875
#define ANSA6                         3876
#define ANSA7                         3877
#define WPUA                          3878
#define WPUA0                         3879
#define WPUA1                         3880
