tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18856_tdd.h
#define WPUA2                         3881
#define WPUA3                         3882
#define WPUA4                         3883
#define WPUA5                         3884
#define WPUA6                         3885
#define WPUA7                         3886
#define ODCONA                        3887
#define ODCA0                         3888
#define ODCA1                         3889
#define ODCA2                         3890
#define ODCA3                         3891
#define ODCA4                         3892
#define ODCA5                         3893
#define ODCA6                         3894
#define ODCA7                         3895
#define SLRCONA                       3896
#define SLRA0                         3897
#define SLRA1                         3898
#define SLRA2                         3899
#define SLRA3                         3900
#define SLRA4                         3901
#define SLRA5                         3902
#define SLRA6                         3903
#define SLRA7                         3904
#define INLVLA                        3905
#define INLVLA0                       3906
#define INLVLA1                       3907
#define INLVLA2                       3908
#define INLVLA3                       3909
#define INLVLA4                       3910
#define INLVLA5                       3911
#define INLVLA6                       3912
#define INLVLA7                       3913
#define IOCAP                         3914
#define IOCAP0                        3915
#define IOCAP1                        3916
#define IOCAP2                        3917
#define IOCAP3                        3918
#define IOCAP4                        3919
#define IOCAP5                        3920
#define IOCAP6                        3921
#define IOCAP7                        3922
#define IOCAN                         3923
#define IOCAN0                        3924
#define IOCAN1                        3925
#define IOCAN2                        3926
#define IOCAN3                        3927
#define IOCAN4                        3928
#define IOCAN5                        3929
#define IOCAN6                        3930
#define IOCAN7                        3931
#define IOCAF                         3932
#define IOCAF0                        3933
#define IOCAF1                        3934
#define IOCAF2                        3935
#define IOCAF3                        3936
#define IOCAF4                        3937
#define IOCAF5                        3938
#define IOCAF6                        3939
#define IOCAF7                        3940
#define CCDNA                         3941
#define CCDNA0                        3942
#define CCDNA1                        3943
#define CCDNA2                        3944
#define CCDNA3                        3945
#define CCDNA4                        3946
#define CCDNA5                        3947
#define CCDNA6                        3948
#define CCDNA7                        3949
#define CCDPA                         3950
#define CCDPA0                        3951
#define CCDPA1                        3952
#define CCDPA2                        3953
#define CCDPA3                        3954
#define CCDPA4                        3955
#define CCDPA5                        3956
#define CCDPA6                        3957
#define CCDPA7                        3958
#define ANSELB                        3959
#define ANSB0                         3960
#define ANSB1                         3961
#define ANSB2                         3962
#define ANSB3                         3963
#define ANSB4                         3964
#define ANSB5                         3965
#define ANSB6                         3966
#define ANSB7                         3967
#define WPUB                          3968
#define WPUB0                         3969
#define WPUB1                         3970
#define WPUB2                         3971
#define WPUB3                         3972
#define WPUB4                         3973
#define WPUB5                         3974
#define WPUB6                         3975
#define WPUB7                         3976
#define ODCONB                        3977
#define ODCB0                         3978
#define ODCB1                         3979
#define ODCB2                         3980
#define ODCB3                         3981
#define ODCB4                         3982
#define ODCB5                         3983
#define ODCB6                         3984
#define ODCB7                         3985
#define SLRCONB                       3986
#define SLRB0                         3987
#define SLRB1                         3988
#define SLRB2                         3989
#define SLRB3                         3990
#define SLRB4                         3991
#define SLRB5                         3992
#define SLRB6                         3993
#define SLRB7                         3994
#define INLVLB                        3995
#define INLVLB0                       3996
#define INLVLB1                       3997
#define INLVLB2                       3998
#define INLVLB3                       3999
#define INLVLB4                       4000
#define INLVLB5                       4001
#define INLVLB6                       4002
#define INLVLB7                       4003
#define IOCBP                         4004
#define IOCBP0                        4005
#define IOCBP1                        4006
#define IOCBP2                        4007
#define IOCBP3                        4008
#define IOCBP4                        4009
#define IOCBP5                        4010
#define IOCBP6                        4011
#define IOCBP7                        4012
#define IOCBN                         4013
#define IOCBN0                        4014
#define IOCBN1                        4015
#define IOCBN2                        4016
#define IOCBN3                        4017
#define IOCBN4                        4018
#define IOCBN5                        4019
#define IOCBN6                        4020
#define IOCBN7                        4021
#define IOCBF                         4022
#define IOCBF0                        4023
#define IOCBF1                        4024
#define IOCBF2                        4025
#define IOCBF3                        4026
#define IOCBF4                        4027
#define IOCBF5                        4028
#define IOCBF6                        4029
#define IOCBF7                        4030
#define CCDNB                         4031
#define CCDNB0                        4032
#define CCDNB1                        4033
#define CCDNB2                        4034
#define CCDNB3                        4035
#define CCDNB4                        4036
#define CCDNB5                        4037
#define CCDNB6                        4038
#define CCDNB7                        4039
#define CCDPB                         4040
#define CCDPB0                        4041
#define CCDPB1                        4042
#define CCDPB2                        4043
#define CCDPB3                        4044
#define CCDPB4                        4045
#define CCDPB5                        4046
#define CCDPB6                        4047
#define CCDPB7                        4048
#define ANSELC                        4049
#define ANSC0                         4050
#define ANSC1                         4051
#define ANSC2                         4052
#define ANSC3                         4053
#define ANSC4                         4054
#define ANSC5                         4055
#define ANSC6                         4056
#define ANSC7                         4057
#define WPUC                          4058
#define WPUC0                         4059
#define WPUC1                         4060
#define WPUC2                         4061
#define WPUC3                         4062
#define WPUC4                         4063
#define WPUC5                         4064
#define WPUC6                         4065
#define WPUC7                         4066
#define ODCONC                        4067
#define ODCC0                         4068
#define ODCC1                         4069
#define ODCC2                         4070
#define ODCC3                         4071
#define ODCC4                         4072
#define ODCC5                         4073
#define ODCC6                         4074
#define ODCC7                         4075
#define SLRCONC                       4076
#define SLRC0                         4077
#define SLRC1                         4078
#define SLRC2                         4079
#define SLRC3                         4080
#define SLRC4                         4081
#define SLRC5                         4082
#define SLRC6                         4083
#define SLRC7                         4084
#define INLVLC                        4085
#define INLVLC0                       4086
#define INLVLC1                       4087
#define INLVLC2                       4088
#define INLVLC3                       4089
#define INLVLC4                       4090
#define INLVLC5                       4091
#define INLVLC6                       4092
#define INLVLC7                       4093
#define IOCCP                         4094
#define IOCCP0                        4095
#define IOCCP1                        4096
#define IOCCP2                        4097
#define IOCCP3                        4098
#define IOCCP4                        4099
#define IOCCP5                        4100
#define IOCCP6                        4101
#define IOCCP7                        4102
#define IOCCN                         4103
#define IOCCN0                        4104
#define IOCCN1                        4105
#define IOCCN2                        4106
#define IOCCN3                        4107
#define IOCCN4                        4108
#define IOCCN5                        4109
#define IOCCN6                        4110
#define IOCCN7                        4111
#define IOCCF                         4112
#define IOCCF0                        4113
#define IOCCF1                        4114
#define IOCCF2                        4115
#define IOCCF3                        4116
#define IOCCF4                        4117
#define IOCCF5                        4118
#define IOCCF6                        4119
#define IOCCF7                        4120
#define CCDNC                         4121
#define CCDNC0                        4122
#define CCDNC1                        4123
#define CCDNC2                        4124
#define CCDNC3                        4125
#define CCDNC4                        4126
#define CCDNC5                        4127
#define CCDNC6                        4128
#define CCDNC7                        4129
#define CCDPC                         4130
#define CCDPC0                        4131
#define CCDPC1                        4132
#define CCDPC2                        4133
#define CCDPC3                        4134
#define CCDPC4                        4135
#define CCDPC5                        4136
#define CCDPC6                        4137
#define CCDPC7                        4138
#define WPUE                          4139
#define WPUE3                         4140
#define INLVLE                        4141
#define INLVLE3                       4142
#define IOCEP                         4143
#define IOCEP3                        4144
#define IOCEN                         4145
#define IOCEN3                        4146
#define IOCEF                         4147
#define IOCEF3                        4148
#define STATUS_SHAD                   4149
#define C_SHAD                        4150
#define DC_SHAD                       4151
#define Z_SHAD                        4152
#define WREG_SHAD                     4153
#define BSR_SHAD                      4154
#define PCLATH_SHAD                   4155
#define FSR0L_SHAD                    4156
#define FSR0H_SHAD                    4157
#define FSR1L_SHAD                    4158
#define FSR1H_SHAD                    4159
#define STKPTR                        4160
#define TOSL                          4161
#define TOSH                          4162

#endif // _PIC16LF18856_H_
